In [1]:
import numpy as np
import pandas as pd

data = {
    'apples': [3, 2, 0, 1],
    'oranges': [0, 3, 7, 2]
}

pd.DataFrame(data,index=["第1","第2","第3","第4"])

    apples  oranges
第1       3        0
第2       2        3
第3       0        7
第4       1        2

In [2]:
data = np.random.randint(50, 101,size=(5,5))
df = pd.DataFrame(data,
            index=["學生1","學生2","學生3","學生4","學生5"],
            columns=["國文","英文","數學","地理","歷史"])
df

     國文  英文  數學  地理   歷史
學生1  66  91  52  86   88
學生2  81  61  73  54   92
學生3  58  67  57  79  100
學生4  55  84  51  89   69
學生5  92  92  75  51   70

In [3]:
#依據欄位名稱的選取
df['國文']
df[['國文','英文']]

     國文  英文
學生1  66  91
學生2  81  61
學生3  58  67
學生4  55  84
學生5  92  92

In [4]:
#可以使用numpy的統計function
sum = np.sum(df,axis=1)
mean = np.mean(df,axis=1)
df['總分'] = sum
df['平均'] = mean

In [5]:
df

     國文  英文  數學  地理   歷史   總分    平均
學生1  66  91  52  86   88  383  76.6
學生2  81  61  73  54   92  361  72.2
學生3  58  67  57  79  100  361  72.2
學生4  55  84  51  89   69  348  69.6
學生5  92  92  75  51   70  380  76.0

In [ ]:
#依據列的選取
#.loc[] -> 依據名稱
#.iloc[] ->這是依據索引

df.loc['學生1']
df.loc[['學生1','學生2']]
df.iloc[0] #類似numpy的選取
df.iloc[:2]
df.iloc[0,:5]
df.iloc[:2,:5]

     國文  英文  數學  地理  歷史
學生1  66  91  52  86  88
學生2  81  61  73  54  92